In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [3]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [15]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(20)

                   city                 date   fare        ride_id
0    Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1    South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2    Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3            Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4            South Jack  2019-03-06 04:28:35  34.58  3908451377344
5          South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6         New Paulville  2019-02-27 11:17:56  43.25   793208410091
7          Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8       South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9         North Jasmine  2019-03-09 06:26:29  42.81  5327642267789
10  New Kimberlyborough  2019-02-07 01:10:11   9.34  7992781920789
11          West Angela  2019-01-12 01:45:27  26.86  4820052223501
12           Rodneyfort  2019-03-02 18:03:20  44.26  2494064867705
13          West Angela  2019-01-10 12:17:31  12.74  2108723916092
14          Roberthaven  2019-05-04 14:48:56  25.66  1026197778354
15          North Jason  2019-03-28 22:28:44   9.19  7007022521141
16         Williamsview  2019-01-03 16:19:25  18.93  1979492913169
17              Leahton  2019-02-26 18:42:15   8.85  6966668662612
18         West Anthony  2019-03-06 02:27:01  10.02  9396763280782
19  New Kimberlyborough  2019-04-25 22:58:38  29.67  4823568522144

In [5]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [6]:
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [7]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [8]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [10]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Rural")

18

In [11]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [12]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [13]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [14]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban